import Texture from "./Texture";


function MarketingText () {
	return (
		<Texture>
		    <div>
  				<a href = "https://skytact.online/">Skytact</a>
  					- это решение, позволяющее создать свою цифровую визитку.
  				</div>
  				<div>
  					<span>Если у вас есть:</span> инста, вк, телега, эл.почта, рабочая почта, ссылка на соц сеть,
  					ссылка на мессенджер, номер мобильного, github, криптокошелёк,
  					мудрая цитата, бородатый анекдот, фотка&nbsp;c&nbsp;котиком, 
  					2-я&nbsp;фотка&nbsp;с&nbsp;🐱, 3-я&nbsp;фотка&nbsp;с&nbsp;🐱, объявление на авито,
  					электронный сертификат о прохождении курса программирования на питоне 🐍 
  					- <b>всё это,</b> легко можно разместить
  					на своей цифровой визитке. А потом идти и показывать её новым знакомым!
  				</div>
  				<div>
  					<span>@ Удиви необычной визиткой!</span>
  				</div>
  				<div>
  					<span>@ Реактивный доступ через QR code!</span>
  				</div>
  				<div>
  					<span>@ Удобная гиперссылка по: skytact.online/your-name</span>
  				</div>
  				<div>
  					<span>@ Защищенный доступ через ssl протокол</span>
  				</div>
		</Texture>	
	);
}

export default MarketingText;
